Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: This feature cannot be combined with the `run-blocking-method-on-quartz-thread` option. If `run-blocking-method-on-quartz-thread` is set, the scheduled method runs on a (platform) thread managed by Quartz.
ja_jp: この機能は `run-blocking-method-on-quartz-thread` オプションと組み合わせることはできません。 `run-blocking-method-on-quartz-thread` が設定されている場合、スケジュールされたメソッドは Quartz が管理する (プラットフォームの) スレッドで実行されます。

source: This feature does not work when using native build.
ja_jp: この機能はネイティブビルドでは動作しません。

source: This feature essentially turns the existing testsuite into a training run.
ja_jp: この機能は本質的に、既存のテストスイートをトレーニング実行に変えます。

source: This feature has also introduced some changes that may affect your application:
ja_jp: また、この機能はいくつか変更点をもたらすため、お客様のアプリケーションに影響を与える可能性があります。

source: This feature has proven invaluable in assisting us in diagnosing performance issues with the extension. It will enable users to provide valuable troubleshooting information in case any issues arise.
ja_jp: この機能は、エクステンションのパフォーマンス上の問題を診断する上で非常に有用であることが証明されています。問題が発生した場合に備えて、ユーザーは貴重なトラブルシューティング情報を提供できるようになります。

source: This feature is available for the following component types:
ja_jp: この機能は、次のコンポーネントタイプで使用できます。

source: This feature is considered experimental and is likely to change in future versions of Quarkus.
ja_jp: この機能は実験的なものと見なされており、Quarkus の将来のバージョンで変更される可能性があります。

source: This feature is currently experimental.
ja_jp: この機能は現在、実験的です。

source: This feature is especially useful when the application must dynamically select a Mongo Client from a predefined set at runtime.
ja_jp: この機能は、アプリケーションが実行時に事前定義されたセットから Mongo クライアントを動的に選択する必要がある場合に特に役立ちます。

source: This feature is especially useful when the application must dynamically select a Redis Client from a predefined set at runtime.
ja_jp: この機能は、アプリケーションが実行時に事前定義されたセットから Redis クライアントを動的に選択する必要がある場合に特に役立ちます。

source: This feature is especially useful when the application must select one datasource from a predefined set at runtime.
ja_jp: この機能は、アプリケーションが実行時に定義済みのセットから1つのデータソースを選択しなければならない場合に特に便利です。

source: This feature is especially useful when you need the application to select one datasource from a predefined set at runtime.
ja_jp: この機能は、実行時にアプリケーションが定義済みのセットから 1 つのデータソースを選択する必要がある場合に特に便利です。

source: This feature is handy when using third-party libraries using object mapping features (such as Jackson or GSON):
ja_jp: この機能は、オブジェクトマッピング機能を使用するサードパーティのライブラリ（JacksonやGSONなど）を使用する際に便利です。

source: This feature is independent of connectors and can be in theory used with channels backed by any connector. Note that pausing message consumption applies back-pressure on the underlying consumer which receives messages from the remote broker.
ja_jp: この機能はコネクターに依存しておらず、理論的には任意のコネクターをベースとするチャネルで使用できます。 メッセージの消費を一時停止すると、リモートブローカーからメッセージを受信する基礎となるコンシューマーにバックプレッシャーが適用されることに注意してください。

source: This feature is introduced as a Technology Preview and is disabled by default.
ja_jp: この機能はTechnology Previewとして導入され、デフォルトでは無効になっています。

source: This feature is not supported when a custom xref:security-customization.adoc#jaxrs-security-context[Jakarta REST SecurityContexts] is used.
ja_jp: この機能は、カスタム xref:security-customization.adoc#jaxrs-security-context[Jakarta REST SecurityContexts] が使用されている場合にはサポートされません。

source: This feature is only available on AWS Lambda, and not in all regions. Please check the AWS documentation to verify the eligibility of your AWS region.
ja_jp: 本機能はAWS Lambdaでのみ利用可能であり、すべてのリージョンで利用できるわけではありません。AWSのドキュメントをご確認の上、ご利用のAWSリージョンが該当するかご確認ください。

source: This feature is turned off by default, but it can be enabled by setting the configuration property `quarkus.rest.jackson.optimization.enable-reflection-free-serializers=true`.
ja_jp: この機能はデフォルトではオフになっていますが、設定プロパティー `quarkus.rest.jackson.optimization.enable-reflection-free-serializers=true` を設定することで有効にできます。

source: This feature is very extensible so if you have ideas to enhance it, don't hesitate to open feature (or pull) requests.
ja_jp: この機能は非常に拡張性が高いので、もし拡張するアイデアがあれば、遠慮なく機能リクエスト（またはプルリクエスト）を出してください。

source: This feature provides a simple and delightful way to offer quick-access AI actions through the Quarkus log.
ja_jp: この機能は、 Quarkus ログを通じて AI アクションへのクイックアクセスを提供する、シンプルで優れた方法です。

source: This feature relies on the xref:credentials-provider.adoc[Credentials Provider] capability.
ja_jp: この機能は、xref:credentials-provider.adoc[クレデンシャルプロバイダー] 機能に依存しています。

source: This feature takes into account the path name and the HTTP server port from your application.properties file in order to create the URL.
ja_jp: この機能では、アプリケーション.propertiesファイルのパス名とHTTPサーバーのポートを考慮して、URLを作成します。

source: This feature was introduced in Quarkus 3.26.0 and will be evolving in the upcoming versions.
ja_jp: この機能は Quarkus 3.26.0 で導入され、今後のバージョンで進化していく予定です。

source: This feature will be removed soon, please update your code base and use `@ConfigMapping` instead.
ja_jp: この機能はまもなく削除される予定です。コードベースを更新し、代わりに `@ConfigMapping` を使用してください。

source: This features a Quarkus Dev service including a Grafana for visualizing data, Loki to store logs, Tempo to store traces and Prometheus to store metrics. Also provides an OTel collector to receive the data.
ja_jp: これには、データを視覚化するための Grafana、ログを保存するための Loki、トレースを保存するための Tempo、メトリクスを保存するための Prometheus を含む Quarkus Dev Service が含まれています。また、データを受信するための OTel コレクターも提供されます。

source: This features a Quarkus Dev service including a Grafana for visualizing data, Loki to store logs, Tempo to store traces and Prometheus to store metrics. Also provides and OTel collector to receive the data.
ja_jp: Quarkus Dev serviceには、データを可視化するGrafana、ログを保存するLoki、トレースを保存するTempo、メトリクスを保存するPrometheusが含まれます。また、データを受け取るためのOTelコレクターも提供します。

source: This file has also been rewritten using the new OOPath notation: as anticipated, here the data source acts as a typed entry-point and the oopath expression has its name as root while the constraints are in square brackets, like in the following example.
ja_jp: このファイルも、新しい OOPath 表記法を使用して書き直されています。予想どおり、ここではデータソースが型指定されたエントリーポイントとして機能し、oopath 式の名前はルートとして設定され、制約は次の例のように角括弧で囲まれています。

source: This file has the usernames and passwords stored in plain text, which is not recommended. If plain-text is set to false (or omitted) in the config then passwords must be stored in the form `MD5 ( username : realm : password )`. This can be generated for the first example above by running the command `echo -n scott:MyRealm:jb0ss | md5` from the command line.
ja_jp: このファイルには、ユーザー名とパスワードがプレーンテキストで保存されていますが、これは推奨されません。設定でプレーンテキストが false に設定されている (または省略されている) 場合、パスワードは `MD5 ( username : realm : password )` の形式で保存されなければなりません。これは上の最初の例では、コマンドラインから `echo -n scott:MyRealm:jb0ss | md5` コマンドを実行することで生成することができます。

source: This file has usernames and passwords stored in plain text, which is not recommended. If plain text is set to false (or omitted) in the config, then passwords must be stored in the form `MD5 ( username : realm : password )`. This can be generated for the first example above by running the command `echo -n scott:MyRealm:jb0ss | md5` from the command line.
ja_jp: このファイルでは、ユーザー名とパスワードがプレーンテキストで保存されていますが、これは推奨されません。設定でプレーンテキストをfalseに設定（または省略）した場合、パスワードは `MD5 ( username : realm : password )` という形式で保存する必要があります。これは、コマンドラインから `echo -n scott:MyRealm:jb0ss | md5` というコマンドを実行することで、上記の最初の例で生成することができます。

source: This file may appear in a deployment extension artifact. It contains a list of classes that implement Quarkus build steps (methods annotated with `io.quarkus.deployment.annotations.BuildStep`). This file is generated as part of the extension project build process and must not be edited manually.
ja_jp: このファイルは、デプロイメントエクステンションアーチファクトに表示される場合があります。Quarkus ビルドステップ (`io.quarkus.deployment.annotations.BuildStep` でアノテーションが付けられたメソッド) を実装するクラスのリストが含まれています。このファイルは、エクステンションプロジェクトのビルドプロセスの一部として生成されます。このファイルを手動で編集してはなりません。

source: This file may appear in a runtime extension artifact as well as in a deployment one. This file must not be edited manually, it is generated as part of the extension project build process and contains a list of Java class names that are annotated with `io.quarkus.runtime.annotations.ConfigRoot` an extension provides.
ja_jp: このファイルは、ランタイムエクステンションアーティファクトおよびデプロイメントアーティファクトに表示される場合があります。このファイルは手動で編集しないでください。これは、エクステンションプロジェクトのビルドプロセスの一部として生成され、エクステンションが提供する `io.quarkus.runtime.annotations.ConfigRoot` でアノテーションが付けられた Java クラス名のリストが含まれています。

source: This filter applies only to the default OpenAPI document, and to the document named `user`.
ja_jp: このフィルターは、デフォルトの OpenAPI ドキュメントと `user` という名前のドキュメントにのみ適用されます。

source: This filter propagates the xref:security-oidc-bearer-token-authentication.adoc[bearer token] present in the currently active request or the token acquired from the xref:security-oidc-code-flow-authentication.adoc[authorization code flow mechanism] as the HTTP `Authorization` header's `Bearer` scheme value.
ja_jp: このフィルターは、現在アクティブなリクエストに存在する xref:security-oidc-bearer-token-authentication.adoc[ベアラートークン]、または xref:security-oidc-code-flow-authentication.adoc[認可コードフローメカニズム] から取得したトークンを、HTTP `Authorization` ヘッダーの `Bearer` スキーム値として伝播します。

source: This first approach has a few drawbacks. It does not benefit from the built-time processing of Quarkus. The logic executed at build time is packaged inside extensions, and in this case, we don't use extensions (except Arc). Another issue is that compiling this application to native will fail because extensions are also involved during the native compilation. Finally, the hot reload won't work, but you can directly restart the application from your IDE.
ja_jp: この最初のアプローチには、いくつかの欠点があります。これはQuarkusのビルド時処理の恩恵を受けていません。ビルド時に実行されるロジックはエクステンションの中にパッケージ化されており、この場合はエクステンションは使用されません(Arcを除く)。もう一つの問題は、このアプリケーションをネイティブにコンパイルすると、ネイティブのコンパイル時にエクステンションも絡んでくるので失敗するということです。最後に、ホットリロードはうまくいきませんが、IDEから直接アプリケーションを再起動することができます。

source: This first example demonstrates how to define a set of rules using the traditional Drools style and how to expose their evaluation inside a REST endpoint through Quarkus.
ja_jp: この最初の例では、従来の Drools スタイルを使用してルールセットを定義する方法と、Quarkus を介して REST エンドポイント内でその評価を公開する方法を示します。

source: This flag **only works on Java 21-23** and has been removed in Java 24+. For Java 24+, use the Quarkus `junit-virtual-threads` extension described in xref:./virtual-threads.adoc#testing-virtual-thread-applications[the virtual thread reference guide], which uses JFR events to detect pinning across all Java versions.
ja_jp: このフラグは **Java 21-23 でのみ動作し** 、Java 24 以降では削除されました。Java 24 以降の場合は、すべての Java バージョンでピン留めを検出するために JFR イベントを使用する、 xref:./virtual-threads.adoc#testing-virtual-thread-applications[仮想スレッドリファレンスガイド] で説明されている Quarkus `junit-virtual-threads` エクステンションを使用してください。

source: This functionality is available with the `@io.quarkus.test.InjectMock` annotation **only if** the `quarkus-junit-mockito` dependency is present:
ja_jp: この機能は、`quarkus-junit-mockito` 依存関係が存在する **場合にのみ**、`@io.quarkus.test.InjectMock` アノテーションで利用可能です:

source: This functionality is available with the `@io.quarkus.test.InjectMock` annotation **only if** the `quarkus-junit5-mockito` dependency is present:
ja_jp: この機能は、 `quarkus-junit5-mockito` 依存関係が存在する場合にのみ、 `@io.quarkus.test.InjectMock` アノテーションで利用できます。

source: This functionality is provided by the `quarkus-openshift` extension. If you want to use a custom Dockerfile, add the file to the `src/main/docker` directory or any location inside the module. Additionally, set the path to your Dockerfile by using the `quarkus.openshift.jvm-dockerfile` property.
ja_jp: この機能は `quarkus-openshift` エクステンションモジュールによって提供されています。カスタムDockerfileを使用したい場合は、 `src/main/docker` ディレクトリまたはモジュール内の任意の場所にファイルを追加してください。 さらに、 `quarkus.openshift.jvm-dockerfile` プロパティを使用して、Dockerfile へのパスを設定します。

source: This functionality is specifically useful in failure scenarios where you can pass the error along with the health check response.
ja_jp: この機能は、ヘルスチェックの応答と一緒にエラーを渡すことができる障害シナリオで特に有用です。

source: This generates a self-signed certificate that the Quarkus Development CA does not sign.
ja_jp: これにより、Quarkus 開発用 CA によって署名されない自己署名証明書が生成されます。

source: This generates an `app-cds.jsa` file.
ja_jp: これにより `app-cds.jsa` ファイルが生成されます。

source: This generation can be disabled using:
ja_jp: この生成を無効にするには、以下を使用します。

source: This goal was introduced in Quarkus Maven plugin 2.7.0.Final and can be used in projects that are based on Quarkus version 2.0.0.Final or later.
ja_jp: このゴールは、Quarkus Maven プラグイン 2.7.0.Final で導入され、Quarkus バージョン 2.0.0.Final 以降をベースとするプロジェクトで使用できます。

source: This goal will resolve all the runtime, build time, test and dev mode dependencies of the application downloading them to the configured local Maven repository.
ja_jp: このゴールは、アプリケーションの実行時、ビルド時、テスト、および開発モードのすべての依存関係を解決し、これらを設定されたローカルの Maven リポジトリーにダウンロードします。

source: This guide also covers the testing of the endpoint.
ja_jp: このガイドでは、エンドポイントのテストについても解説します。

source: This guide assumes you already have the completed application from the `getting-started` directory.
ja_jp: このガイドでは、 `getting-started` ディレクトリーの完成したアプリケーションをすでに持っていることを前提としています。

source: This guide builds and executes Quarkus native executables within a Linux environment. To offer a homogeneous experience across all environments, the guide relies on a container runtime environment to build and run the native executables. The instructions below use Docker as example, but very similar commands should work on alternative container runtimes, e.g. podman.
ja_jp: このガイドでは、Linux 環境内で Quarkus ネイティブ実行可能ファイルをビルドして実行します。すべての環境で同種のエクスペリエンスを提供するために、ガイドはコンテナーランタイム環境に依存して、ネイティブ実行可能ファイルをビルドおよび実行します。以下の手順では例として Docker を使用していますが、podman などの他のコンテナーランタイムでも、よく似たコマンドを実行できます。

source: This guide complements the information available in the GraalVM website with further observations particularly relevant to Quarkus applications.
ja_jp: このガイドは、GraalVM Web サイトで入手可能な情報を補足し、特に Quarkus アプリケーションに関連する詳細な考察を加えています。

source: This guide contains various tips and tricks for getting around problems that might arise when attempting to run Java applications as native executables.
ja_jp: このガイドには、Java アプリケーションをネイティブ実行可能ファイルとして実行しようとしたときに発生する可能性のある問題を回避するためのさまざまなヒントやコツが記載されています。

source: This guide covered the creation of a native (binary) executable for your application. It provides an application exhibiting a swift startup time and consuming less memory. However, there is much more.
ja_jp: このガイドでは、アプリケーション用のネイティブ (バイナリー) 実行ファイルの作成について説明しました。 これにより、迅速な起動時間と少ないメモリー消費を示すアプリケーションを提供します。しかし、それだけではありません。

source: This guide covered the creation of an application using Quarkus. However, there is much more. We recommend continuing the journey by creating xref:getting-started-dev-services.adoc[your second Quarkus application], with Dev Services and persistence. You can learn about creating a native executable and packaging it in a container with the xref:building-native-image.adoc[building a native executable guide]. If you are interested in reactive, we recommend the xref:getting-started-reactive.adoc[getting started with reactive guide], where you can see how to implement reactive applications with Quarkus.
ja_jp: このガイドでは、Quarkusを使用したアプリケーションの作成について説明しました。 しかし、まだ多くのことがあります。 引き続き、Dev Servicesと永続化を使用して、 xref:getting-started-dev-services.adoc[2つ目のQuarkusアプリケーション] を作成することをお勧めします。 ネイティブ実行可能ファイルの作成とコンテナへのパッケージングについては、 xref:building-native-image.adoc[ネイティブ実行可能ファイルの作成ガイド] を参照してください。リアクティブに興味がある場合は、Quarkusでリアクティブアプリケーションを実装する方法を確認できる、 xref:getting-started-reactive.adoc[リアクティブ入門ガイド] をお勧めします。

source: This guide covered the creation of an application using Quarkus. However, there is much more. We recommend continuing the journey by creating xref:getting-started-dev-services.adoc[your second Quarkus application], with dev services and persistence. You can learn about creating a native executable and packaging it in a container with the xref:building-native-image.adoc[building a native executable guide]. If you are interested in reactive, we recommend the xref:getting-started-reactive.adoc[getting started with reactive guide], where you can see how to implement reactive applications with Quarkus.
ja_jp: このガイドでは、Quarkusを使用したアプリケーションの作成について説明しました。 しかし、まだ多くのことがあります。 引き続き、開発サービスと永続性を備えた xref:getting-started-dev-services.adoc[2つ目のQuarkusアプリケーション] を作成することをお勧めします。 ネイティブ実行可能ファイルの作成とコンテナへのパッケージ化については、 xref:building-native-image.adoc[ネイティブ実行可能ファイルの作成ガイド] を参照してください。 リアクティブに興味がある場合は、Quarkusでリアクティブアプリケーションを実装する方法を確認できる、 xref:getting-started-reactive.adoc[リアクティブを始めるガイド] をお勧めします。

source: This guide covered the creation of an application using Quarkus. However, there is much more. We recommend continuing the journey with the xref:building-native-image.adoc[building a native executable guide], where you learn about creating a native executable and packaging it in a container. If you are interested in reactive, we recommend the xref:getting-started-reactive.adoc[Getting Started with Reactive guide], where you can see how to implement reactive applications with Quarkus.
ja_jp: このガイドでは、Quarkus を使用したアプリケーションの作成について説明しました。 しかし、まだまだ多くのことがあります。 xref:building-native-image.adoc[ネイティブ実行可能ファイルのビルド] で、ネイティブ実行可能ファイルの作成とコンテナーへのパッケージ化について学習することを推奨します。 リアクティブに興味がある場合は、リアクティブアプリケーションを Quarkus で実装する方法を解説した xref:get-started-reactive.adoc[リアクティブ入門ガイド] をお勧めします。

source: This guide covers generating and deploying OpenShift resources based on sane default and user supplied configuration.
ja_jp: このガイドでは、妥当なデフォルト設定とユーザーが提供する設定に基づいたOpenShiftリソースの生成とデプロイについて説明します。

source: This guide covers how to deploy a native application on Kubernetes.
ja_jp: このガイドでは、Kubernetes上にネイティブアプリケーションをデプロイする方法を説明します。

source: This guide covers how to deploy a native application on OpenShift.
ja_jp: このガイドでは、OpenShift上にネイティブアプリケーションをデプロイする方法を説明します。

source: This guide covers how to develop, build and serve your npm-compatible web applications such as React, Angular, Vue, Lit, Svelte, Astro, SolidJS, and others alongside Quarkus.
ja_jp: このガイドでは、React、Angular、Vue、Lit、Svelte、Astro、SolidJS など、npm と互換性のあるウェブアプリケーションを Quarkus とともに開発、ビルド、提供する方法について説明します。

source: This guide covers how to interact with an Elasticsearch cluster using the low level REST client or the Elasticsearch Java client.
ja_jp: このガイドでは、低レベルのRESTクライアントまたはElasticsearch Javaクライアントを使用して、Elasticsearchクラスタと対話する方法を説明します。

source: This guide covers how to set up bundling and minification (with source-map) for your web app scripts (JS, JSX, TS, TSX), dependencies (jQuery, htmx, Bootstrap, Lit etc.), and styles (CSS, SCSS, SASS).
ja_jp: このガイドでは、ウェブアプリのスクリプト (JS, JSX, TS, TSX)、依存関係 (jQuery, htmx, Bootstrap, Lit など)、およびスタイル (CSS, SCSS, SASS) のバンドルとミニファイ (ソースマップ付き) を設定する方法について説明します。

source: This guide covers how to test your Quarkus web application with Playwright.
ja_jp: このガイドでは、Playwright を使用して Quarkus ウェブアプリケーションをテストする方法について説明します。

source: This guide covers how to use GCP BigQuery in Quarkus.
ja_jp: このガイドでは、QuarkusでGCP BigQueryを使用する方法について説明します。

source: This guide covers how to use GCP Bigtable in Quarkus.
ja_jp: このガイドでは、QuarkusでGCP Bigtableを使用する方法について説明します。

source: This guide covers how to use GCP Firestore in Quarkus.
ja_jp: このガイドでは、QuarkusでGCP Firestoreを使用する方法について説明します。

source: This guide covers how to use GCP PubSub in Quarkus.
ja_jp: このガイドでは、QuarkusでGCP PubSubを使用する方法について説明します。

source: This guide covers how to use GCP Secret Manager in Quarkus to consume configuration properties directly or via your `application.properties`.
ja_jp: このガイドでは、QuarkusでGCP Secret Managerを使用して、設定プロパティを直接または `application.properties` 経由で消費する方法を説明します。

source: This guide covers how to use GCP Spanner in Quarkus.
ja_jp: このガイドでは、QuarkusでGCP Spannerを使用する方法について説明します。

source: This guide covers how to use GCP Storage in Quarkus.
ja_jp: このガイドでは、QuarkusでGCP Storageを使用する方法について説明します。

source: This guide covers how to use Hibernate Validator/Bean Validation for:
ja_jp: このガイドでは、以下の場合のHibernate Validator/Bean Validation の使用方法について説明します:

source: This guide covers how to use Hibernate Validator/Bean Validation in your REST services.
ja_jp: このガイドでは、RESTサービスでHibernate Validator/Bean Validationを使用する方法について説明します。

source: This guide covers how to use Infinispan with Quarkus.
ja_jp: このガイドでは、QuarkusでInfinispanを使用する方法について説明します。

source: This guide covers how to use MongoDB in Quarkus.
ja_jp: このガイドでは、QuarkusでMongoDBを使用する方法について説明します。

source: This guide covers how to use a Redis datastore in Quarkus.
ja_jp: このガイドでは、QuarkusでRedisデータストアを使用する方法について説明します。

source: This guide covers how to use an Elasticsearch cluster using the low level or high level REST clients.
ja_jp: このガイドでは、低レベルまたは高レベルのRESTクライアントを使用してElasticsearchクラスタを使用する方法について説明します。

source: This guide covers how to use multiple GCP services.
ja_jp: このガイドでは、複数のGCPサービスの使用方法について説明します。

source: This guide covers how to use the AWS Systems Manager in Quarkus.
ja_jp: このガイドでは、QuarkusでのAWS Systems Managerの使用方法について説明します。

source: This guide covers how to use the Amazon DynamoDB database in Quarkus.
ja_jp: このガイドでは、QuarkusでAmazon DynamoDBデータベースを使用する方法を説明します。

source: This guide covers how to use the Amazon Identity and Access Management in Quarkus.
ja_jp: このガイドでは、QuarkusでのAmazon Identity and Access Managementの使用方法について説明します。

source: This guide covers how to use the Amazon Key Management Service in Quarkus.
ja_jp: このガイドでは、QuarkusでのAmazon Key Management Serviceの使用方法について説明します。

source: This guide covers how to use the Amazon S3 cloud storage in Quarkus.
ja_jp: このガイドでは、QuarkusでのAmazon S3クラウドストレージの使い方を紹介しています。

source: This guide covers how to use the Amazon Simple Email Service in Quarkus.
ja_jp: このガイドでは、QuarkusでAmazon Simple Mail Serviceの使用方法について説明します。

source: This guide covers how to use the Amazon Simple Notification Service in Quarkus.
ja_jp: このガイドでは、QuarkusでAmazon Simple Notification Serviceの使用方法について説明します。

source: This guide covers how to use the Amazon Simple Queue Service in Quarkus.
ja_jp: このガイドでは、QuarkusでAmazon Simple Queue Serviceの使用方法について説明します。

source: This guide covers how to use the Apache Cassandra NoSQL database in Quarkus.
ja_jp: このガイドでは、QuarkusでApache Cassandra NoSQLデータベースを使用する方法について説明します。

source: This guide covers how to use the Flyway extension to manage your schema migrations.
ja_jp: このガイドでは、Flyway エクステンションを使用してスキーマのマイグレーションを管理する方法について説明します。

source: This guide covers how to use the Liquibase extension to manage your schema migrations.
ja_jp: このガイドでは、スキーマのマイグレーションを管理するための Liquibase エクステンションの使い方を説明します。

source: This guide covers how to use the Neo4j graph database in Quarkus.
ja_jp: このガイドでは、QuarkusでNeo4jグラフデータベースを使用する方法について説明します。

source: This guide covers how to use the Reactive SQL Clients in Quarkus.
ja_jp: このガイドでは、QuarkusのReactive SQLクライアントの使用方法について説明します。

source: This guide covers packaging and releasing CLI applications using the JReleaser tool.
ja_jp: このガイドでは、JReleaserツールを使用したCLIアプリケーションのパッケージングとリリースについて説明します。

source: This guide covers packaging and releasing CLI applications using the link:https://jreleaser.org[JReleaser] tool.
ja_jp: このガイドでは、link:https://jreleaser.org[JReleaser] ツールを使ったCLIアプリケーションのパッケージングとリリースについて説明します。

source: This guide covers testing in JVM mode, native mode, and injection of resources into tests
ja_jp: このガイドでは、JVMモード、ネイティブモードでのテスト、リソースのテストへの注入についてカバーしています

source: This guide covers the Dev Services and UI for OpenID Connect (OIDC) Keycloak provider and explains how to support Dev Services and UI for other OpenID Connect providers. It also describes Dev UI for all OpenID Connect providers which have already been started before Quarkus is launched in a dev mode.
ja_jp: このガイドでは、OpenID Connect（OIDC）のKeycloakプロバイダのDev ServicesとUIを取り上げ、他のOpenID ConnectプロバイダのDevサービスとUIをサポートする方法について説明します。また、Quarkusを開発モードで起動する前にすでに開始されているすべてのOpenID ConnectプロバイダのDev UIについても説明しています。
